const currentYear = new Date().getFullYear();
document.getElementById("year").innerText = currentYear;
document.getElementById("year1").innerText = currentYear;
function updateTotalOrderDisplay() {
  let totalOrderNumber = document.getElementById("totalOrder");
  let totalOrderNumber1 = document.getElementById("totalOrder1");
  let totalOrder = parseInt(localStorage.getItem("totalOrder")) || 0;
  totalOrderNumber.style.display = totalOrder > 0 ? "flex" : "none";
  totalOrderNumber.innerHTML = totalOrder;
  totalOrderNumber1.innerHTML = totalOrder;
  totalOrderNumber1.style.display = totalOrder > 0 ? "flex" : "none";
}
updateTotalOrderDisplay();
let text1 = `স্বাগতম। আমাদের কুকি নীতি আপনার ওয়েবসাইট অভিজ্ঞতা উন্নত করার জন্য
  কুকি এবং অন্যান্য প্রযুক্তিগুলি ব্যবহার করা সম্পর্কে আপনাকে ব্যাখ্যা
  দেয়। আমাদের ওয়েবসাইট ব্যবহার করার সাথে সাথে, আপনি এই নীতির অনুসারে
  কুকি ব্যবহারে সম্মত হন কুকি ফাইল কি? কুকি ফাইল হল ছোট টেক্সট ফাইলগুলি,
  যা আপনার ডিভাইসে (কম্পিউটার, ট্যাবলেট, মোবাইল ফোন) ওয়েবসাইট দেখার
  সময় সংরক্ষিত হয়। এই ফাইলগুলিতে তথ্য থাকে, যা ব্যবহারকারীর ফাংশনালিটি
  এবং অভিজ্ঞতার জন্য ব্যবহৃত হয়। আমরা ব্যবহৃত কুকি ফাইলের প্রকার: মৌলিক
  কুকি ফাইলগুলি: এই কুকি ফাইলগুলি আমাদের ওয়েবসাইটের মৌলিক কার্যকারিতা
  জন্য প্রয়োজনীয়। এগুলি পৃষ্ঠাগুলি মধ্যে নেভিগেশন এবং সাইটের সুরক্ষিত
  অংশে অ্যাক্সেস দেওয়ার মতো সেবা সরবরাহ করে। কার্যক্ষমতা পরিমাপের কুকি
  ফাইলগুলি: এই কুকি ফাইলগুলি আমরা আপনার ওয়েবসাইট ব্যবহার প্রবৃত্তি
  সম্পর্কে তথ্য সংগ্রহ করি, যেমন আপনি কোন পৃষ্ঠা দেখছেন, আপনি যে কোন
  ত্রুটি খুঁজছেন ইত্যাদি। সংগ্রহকৃত তথ্যটি সাইটের কার্যক্ষমতা উন্নত করার
  জন্য ব্যবহৃত হয়। কার্যক্ষমতা কুকি ফাইলগুলি: এই কুকি ফাইলগুলি আমাদের
  ওয়েবসাইটকে আপনার নিজস্ব সেটিংস এবং পছন্দসমূহ মনে রাখতে সাহায্য করে,
  যেমন আপনার ব্যবহারকারী নাম, ভাষা বা অঞ্চল একটি ব্যক্তিগত অভিজ্ঞতা
  প্রদান করার জন্য। বিজ্ঞাপন কুকি ফাইলগুলি: আমরা আপনার সাথে যুক্ত
  বিজ্ঞাপন দেখাতে এবং আপনির জন্য যোগাযোগ করার জন্য তৃতীয় পক্ষের কুকি
  ফাইল ব্যবহার করি। এই কু কুকি ফাইল সম্পর্কে নিয়ন্ত্রণ: আপনি বিভিন্ন
  উপায়ে কুকি ফাইল সম্পর্কে নিয়ন্ত্রণ করতে পারেন। কুকি ফাইল বন্ধ করা
  আপনার ওয়েবসাইটের কার্যক্ষমতা প্রভাবিত করতে পারে এটি মনে রাখবেন।
  ব্রাউজার সেটিং: আপনি আপনার ব্রাউজার সেটিং কে পরিবর্তন করে কুকি ফাইল
  গুলি সহজে গ্রহণ, অগ্রাহ্য বা মুছে ফেলতে পারেন। আপনার ব্রাউজারের
  সাহায্য অধ্যায়ে অতিরিক্ত তথ্য পেতে অনুগ্রহ করে দেখুন। গোপনীয়তা টুলস:
  আপনি আপনার ডেটা এর ব্যবহার নিয়ন্ত্রণ করতে অনলাইন গোপনীয়তা টুলস
  ব্যবহার করতে পারেন যা আপনাকে অনুমতি দেয় কিভাবে আপনার ডেটা ব্যবহৃত
  হবে। কুকি ফাইল নীতিতে পরিবর্তন: আমরা এই নীতিতে পরিবর্তন সাধারণত এটি
  প্রযোজ্য হবে এবং আমরা যে সবগুলি পরিবর্তন করি তা সবসময় আমাদের
  ওয়েবসাইটে উন্মুক্ত থাকবে। আমাদের ওয়েবসাইট ব্যবহার করে, আপনি আমাদের
  কুকি ফাইল নীতি অনুযায়ী কুকি ফাইল গুলি ব্যবহার করার সাথে সম্মত হন। যদি
  আপনি এই নীতিতে সম্মত না হন, তবে আমরা আপনাকে কুকি ফাইল নীতি অনুযায়ী
  ব্যবহার করার বদলে কুকি ফাইল বন্ধ করার সুপারিশ দিচ্ছি অথবা আমাদের
  ওয়েবসাইট ব্যবহার করার থেকে বিরত থাকার পরামর্শ দিচ্ছি। যদি আপনার কোনও
  প্রশ্ন থাকে আমাদের কুকি ফাইল নীতি সম্পর্কে, অনুগ্রহ করে আমাদের সাথে
  যোগাযোগ করুন। ভিজিট করার জন্য আপনাকে ধন্যবাদ।`;
let text2 = `কুকি ফাইল সম্পর্কে নিয়ন্ত্রণ: আপনি বিভিন্ন উপায়ে কুকি ফাইল সম্পর্কে
  নিয়ন্ত্রণ করতে পারেন। কুকি ফাইল বন্ধ করা আপনার ওয়েবসাইটের কার্যক্ষমতা
  প্রভাবিত করতে পারে এটি মনে রাখবেন। ব্রাউজার সেটিং: আপনি আপনার ব্রাউজার
  সেটিং কে পরিবর্তন করে কুকি ফাইল গুলি সহজে গ্রহণ, অগ্রাহ্য বা মুছে
  ফেলতে পারেন। আপনার ব্রাউজারের সাহায্য অধ্যায়ে অতিরিক্ত তথ্য পেতে
  অনুগ্রহ করে দেখুন। গোপনীয়তা টুলস: আপনি আপনার ডেটা এর ব্যবহার
  নিয়ন্ত্রণ করতে অনলাইন গোপনীয়তা টুলস ব্যবহার করতে পারেন যা আপনাকে
  অনুমতি দেয় কিভাবে আপনার ডেটা ব্যবহৃত হবে।`;
let text3 = `  ্বাগতম। এই শর্তাবলী এবং শর্তাদি আমাদের ওয়েবসাইট এবং তার সমস্ত সেবার
ব্যবহারের শর্তাবলী স্থাপন করে।`;

let normalizedText1 = text1.normalize("NFC");
document.getElementById("text1").innerText = normalizedText;
let normalizedText2 = text2.normalize("NFC");
document.getElementById("text2").innerText = normalizedText;
let normalizedText3 = text3.normalize("NFC");
document.getElementById("text3").innerText = normalizedText;
